/* 21.01 Anna Melnyk(Golovenko)
Check result in console please*/
//ACT 2
const roles = ["Почтмейстер", "Городничий", "Аммос Федорович"];
const textlines = "Почтмейстер. Объясните, господа, что, какой чиновник едет?\
 Городничий. А вы разве не слышали?\
 Почтмейстер. Слышал от Петра Ивановича Бобчинского. Он только что был у меня в почтовой конторе.\
 Городничий. Ну, что? Как вы думаете об этом?\
 Почтмейстер. А что думаю? война с турками будет.\
 Аммос Федорович. В одно слово! я сам то же думал.\
 Городничий. Да, оба пальцем в небо попали!\
 Почтмейстер. Право, война с турками. Это все француз гадит.\
 Городничий. Какая война с турками! Просто нам плохо будет, а не туркам. Это уже известно: у меня письмо.\
 Почтмейстер. А если так, то не будет войны с турками.\
 Городничий. Ну что же, как вы, Иван Кузьмич?\
 Почтмейстер. Да что я? Как вы, Антон Антонович?\
 Городничий. Да что я? Страху-то нет, а так, немножко... Купечество да гражданство меня смущает. Говорят, что я им солоно пришелся, а я, вот ей-Богу, если и взял с иного, то, право, без всякой ненависти. Я даже думаю (берет его под руку и отводит в сторону), я даже думаю, не было ли на меня какого-нибудь доноса. Зачем же в самом деле к нам ревизор? Послушайте, Иван Кузьмич, нельзя ли вам, для общей нашей пользы, всякое письмо, которое прибывает к вам в почтовую контору, входящее и исходящее, знаете, этак немножко распечатать и прочитать: не содержится ли в нем какого-нибудь донесения или просто переписки. Если же нет, то можно опять запечатать; впрочем, можно даже и так отдать письмо, распечатанное.\
 Почтмейстер. Знаю, знаю... Этому не учите, это я делаю не то чтоб из предосторожности, а больше из любопытства: смерть люблю узнать, что есть нового на свете. Я вам скажу, что это преинтересное чтение. Иное письмо с наслажденьем прочтешь — так описываются разные пассажи... а назидательность какая... лучше, чем в «Московских ведомостях»!\
 Городничий. Ну что ж, скажите, ничего не начитывали о каком-нибудь чиновнике из Петербурга?\
 Почтмейстер. Нет, о петербургском ничего нет, а о костромских и саратовских много говорится. Жаль, однако ж, что вы не читаете писем: есть прекрасные места. Вот недавно один поручик пишет к приятелю и описал бал в самом игривом... очень, очень хорошо: «Жизнь моя, милый друг, течет, говорит, в эмпиреях: барышень много, музыка играет, штандарт скачет...» — с большим, с большим чувством описал. Я нарочно оставил его у себя. Хотите, прочту?\
 Городничий. Ну, теперь не до того. Так сделайте милость, Иван Кузьмич: если на случай попадется жалоба или донесение, то без всяких рассуждений задерживайте.\
 Почтмейстер. С большим удовольствием.\
 Аммос Федорович. Смотрите, достанется вам когда-нибудь за это.\
 Почтмейстер. Ах, батюшки!\
 Городничий. Ничего, ничего. Другое дело, если бы вы из этого публичное что-нибудь сделали, но ведь это дело семейственное.\
 Аммос Федорович. Да, нехорошее дело заварилось! А я, признаюсь, шел было к вам, Антон Антонович, с тем чтобы попотчевать вас собачонкою. Родная сестра тому кобелю, которого вы знаете. Ведь вы слышали, что Чептович с Варховинским затеяли тяжбу, и теперь мне роскошь: травлю зайцев на землях и у того и у другого.\
 Городничий. Батюшки, не милы мне теперь ваши зайцы: у меня инкогнито проклятое сидит в голове. Так и ждешь, что вот отворится дверь и — шасть..."

let arrayOfStrings = [];
let replacedString1, replacedString2, replacedString3;
function splitString(stringToSplit, separator1, separator2, separator3) {
	replacedString1 = stringToSplit.replace(separator1, "~" + separator1);
	replacedString2 = replacedString1.replace(separator2, "~" + separator2);
	replacedString3 = replacedString2.replace(separator3, "~" + separator3);
	arrayOfStrings = replacedString3.split("~");

	for(let i = 1; i < arrayOfStrings.length; i++) {
		arrayOfStrings[i] = i + ")" + arrayOfStrings[i];
	}
	
	return arrayOfStrings;
}

function makeReplics(role, part) {
	console.log(roles[role] + ":");
	for(let i = 1; i < arrayOfStrings.length; i++) {
		if(arrayOfStrings[i].includes(part)) {
			let newTextLine = arrayOfStrings[i].toString().replace(part, "");
			console.log(newTextLine);
		}
	}	
}

splitString(textlines, /Почтмейстер./g, /Городничий./g, /Аммос Федорович./g);

makeReplics(0, "/Почтмейстер./g");
makeReplics(1, "/Городничий./g");
makeReplics(2, "/Аммос Федорович./g");



